-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2024-04-09 16:11:01
-- サーバのバージョン： 10.4.32-MariaDB
-- PHP のバージョン: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `gs_db6`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `gs_tasktemplete_table`
--

CREATE TABLE `gs_tasktemplete_table` (
  `id` int(11) NOT NULL,
  `column_id` int(11) NOT NULL,
  `title` varchar(64) NOT NULL,
  `taskevent` varchar(68) DEFAULT NULL,
  `assignee` varchar(256) DEFAULT NULL,
  `duedate` date DEFAULT NULL,
  `box` varchar(68) NOT NULL,
  `memo` text DEFAULT NULL,
  `completed` int(11) NOT NULL DEFAULT 0,
  `indate` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- テーブルのデータのダンプ `gs_tasktemplete_table`
--

INSERT INTO `gs_tasktemplete_table` (`id`, `column_id`, `title`, `taskevent`, `assignee`, `duedate`, `box`, `memo`, `completed`, `indate`) VALUES
(2, 1, '引合受領', '見積依頼受領', '', '0000-00-00', 'バイヤーポータルからダウンロード/メールで受領', '', 0, '0000-00-00 00:00:00'),
(3, 1, '引合受領', '台帳/採番', '', '0000-00-00', '引合管理、管理番号採番', '', 0, '0000-00-00 00:00:00'),
(4, 1, '引合受領', '関連書類保存場所作成（電子）', '', '0000-00-00', '規定SPOに案件フォルダ作成', '', 0, '0000-00-00 00:00:00'),
(5, 1, '引合受領', '見積提出期限フォロー', '', '0000-00-00', '提出期限、提出可能日を確認、連絡', '', 0, '0000-00-00 00:00:00'),
(6, 1, '引合内容確認', '内容確認', '', '0000-00-00', 'アイテム必要情報、受注角度、実績を確認', '', 0, '0000-00-00 00:00:00'),
(7, 1, '引合送付', '見積依頼　', '', '0000-00-00', '情報加工の後、引合先へ依頼', '', 0, '0000-00-00 00:00:00'),
(8, 1, '取引先情報確認', '信用情報確認・調査', '', '0000-00-00', 'ACTIS登録情報確認、財務データ取得、カントリーリスク確認', '', 0, '0000-00-00 00:00:00'),
(9, 1, '取引先情報確認', '安全保障貿易管理（取引審査）', '', '0000-00-00', '禁止国情報、DowJones、確認', '', 0, '0000-00-00 00:00:00'),
(10, 1, '原価受領', '支払い条件選定', '', '0000-00-00', '下請法該当有無確認', '', 0, '0000-00-00 00:00:00'),
(11, 1, '原価受領', 'RFQとの整合性確認', '', '0000-00-00', 'RFQと見積の整合性確認、修正', '', 0, '0000-00-00 00:00:00'),
(12, 1, '原価受領', '貨物概算PPD確認', '', '0000-00-00', '概算　寸法・重量・数量確認、受渡条件選定', '', 0, '0000-00-00 00:00:00'),
(13, 1, '原価受領', 'EL/危険品有無確認', '', '0000-00-00', 'EL/危険品有無確認', '', 0, '0000-00-00 00:00:00'),
(14, 1, '見積作成', '必要コスト算出', '', '0000-00-00', '輸送、梱包、保険、為替、ボンド、TAX', '', 0, '0000-00-00 00:00:00'),
(15, 1, '見積作成', '物流業者登録・信用調査', '', '0000-00-00', '起用業者の選定、調査、登録', '', 0, '0000-00-00 00:00:00'),
(16, 1, '見積作成', '為替損益分岐点算出', '', '0000-00-00', '外貨の場合、算出しリスク値設定', '', 0, '0000-00-00 00:00:00'),
(17, 1, '見積作成', '採算表作成', '', '0000-00-00', '経伺用採算表作成', '', 0, '0000-00-00 00:00:00'),
(18, 1, '見積作成', '見積書作成', '', '0000-00-00', '見積書作成・承認取得', '', 0, '0000-00-00 00:00:00'),
(19, 1, '見積作成', '見積提出', '', '0000-00-00', 'バイヤーポータルへアップロード/メールで送付', '', 0, '0000-00-00 00:00:00'),
(20, 1, '見積作成', '見積提出期限内での契約フォロー', '', '0000-00-00', '見積提出期限内でPO受領、見積有効期限延長依頼', '', 0, '0000-00-00 00:00:00'),
(21, 2, 'クラリ/ネゴ', '技術条件、商務条件確認　交渉', '', '0000-00-00', 'ジェネコンDeviation　List作成', '', 0, '0000-00-00 00:00:00'),
(22, 2, 'PO受領', '契約書受領/ドラフト作成', '', '0000-00-00', 'バイヤーポータルからダウンロード/メールで受領', '', 0, '0000-00-00 00:00:00'),
(23, 2, 'PO内容確認', '見積内容との整合性確認', '', '0000-00-00', 'POと見積の整合性確認、修正', '', 0, '0000-00-00 00:00:00'),
(24, 2, '受注処理', 'キャッチオール・リスト規制確認', '', '0000-00-00', '貨物・技術・図面、顧客・最終需要者・最終用途・取引内容・米国再輸出規制など関連法規チェック', '', 0, '0000-00-00 00:00:00'),
(25, 2, '受注処理', '成約・信用リスク管理', '', '0000-00-00', '限度システムに入力、経常申請', '', 0, '0000-00-00 00:00:00'),
(26, 2, '受注処理', '計上台帳作成', '', '0000-00-00', 'SRインプット台帳作成', '', 0, '0000-00-00 00:00:00'),
(27, 2, '受注処理', '売上計上', '', '0000-00-00', 'SRインプット', '', 0, '0000-00-00 00:00:00'),
(28, 2, '受注処理', '印紙税納税', '', '0000-00-00', '印紙税要否確認、貼付納税処理', '', 0, '0000-00-00 00:00:00'),
(29, 2, '受注処理', '貿易保険', '', '0000-00-00', '付保要否判定、申請書作成', '', 0, '0000-00-00 00:00:00'),
(30, 2, '受注処理', '為替予約　', '', '0000-00-00', '一般為替予約要否確認、登録', '', 0, '0000-00-00 00:00:00'),
(31, 2, '契約発効', '契約発効要件の確認・対応', '', '0000-00-00', 'LC/前金/BONDなどの要件確認・対応', '', 0, '0000-00-00 00:00:00'),
(32, 2, '契約発効', '契約発効達成確認書の発行', '', '0000-00-00', '発効日の確認、Cert作成', '', 0, '0000-00-00 00:00:00'),
(33, 2, '注文書', '注文書・請書作成・発行', '', '0000-00-00', '見積書とPO条件反映した注文書を作成', '', 0, '0000-00-00 00:00:00'),
(34, 4, 'LC', 'LC Offer Sheet作成', '', '0000-00-00', 'LC Open依頼を作成し、必要条件記載する', '', 0, '0000-00-00 00:00:00'),
(35, 4, 'LC', 'LCチェック、銀行チェック', '', '0000-00-00', '関連銀行の格付、LC文言確認', '', 0, '0000-00-00 00:00:00'),
(36, 4, 'LC', 'LCネゴ　必要書類対応', '', '0000-00-00', '対応書類、部数など確認・作成', '', 0, '0000-00-00 00:00:00'),
(37, 3, '輸送アレンジ', 'Forwarder情報入手・コンタクト', '', '0000-00-00', 'Buyer起用の輸送業者の連絡先を受領、コンタクトする', '', 0, '0000-00-00 00:00:00'),
(38, 3, '輸送アレンジ', 'Forwarder 会社登録、物流業者管理リスト', '', '0000-00-00', '取引先コードの確認、業者登録確認/登録作業', '', 0, '0000-00-00 00:00:00'),
(39, 3, '輸送アレンジ', 'Forwarder 与信情報調査', '', '0000-00-00', '取引先としてのチェック（DowJones）', '', 0, '0000-00-00 00:00:00'),
(40, 3, '輸送アレンジ', 'Cargo Raadyフォロー', '', '0000-00-00', '納期の１か月前よりフォロー。梱包完了日、貨物搬入可能日を確認する。', '', 0, '0000-00-00 00:00:00'),
(41, 3, '輸送アレンジ', 'Booking調整', '', '0000-00-00', '船社スケジュールを入手して調整する', '', 0, '0000-00-00 00:00:00'),
(42, 3, '輸送アレンジ', '各種Certフォーマット準備', '', '0000-00-00', 'ドラフト作成し、Buyerと確認', '', 0, '0000-00-00 00:00:00'),
(43, 3, '輸送アレンジ', '必要書類を受領し、確認', '', '0000-00-00', '該非判定書、Packing List、Cert入手フォロー、チェック', '', 0, '0000-00-00 00:00:00'),
(44, 3, '輸送アレンジ', '本邦通関用書類作成、送付', '', '0000-00-00', 'Shipping Instruction、該非、PL、IVをセットで作成、送付', '', 0, '0000-00-00 00:00:00'),
(45, 3, '輸送アレンジ', '海上保険付保用IVドラフト作成', '', '0000-00-00', 'IVドラフト作成して、輸入地側に確認', '', 0, '0000-00-00 00:00:00'),
(46, 3, '輸送アレンジ', '海上保険付保依頼', '', '0000-00-00', 'システムに入力、申請', '', 0, '0000-00-00 00:00:00'),
(47, 3, '輸送アレンジ', 'BLドラフトチェック', '', '0000-00-00', 'FWDよりBLドラフト受領し内容確認、訂正依頼', '', 0, '0000-00-00 00:00:00'),
(48, 3, '輸送アレンジ', '輸出許可書入手・確認', '', '0000-00-00', '許可書の内容を確認し、修正依頼', '', 0, '0000-00-00 00:00:00'),
(49, 3, '輸送アレンジ', '現地輸入通関用書類作成、送付', '', '0000-00-00', '必要なCert関連と、IV、PL、BLを送る', '', 0, '0000-00-00 00:00:00'),
(50, 3, '輸送アレンジ', '完了確認書作成、送付', '', '0000-00-00', '検収用書類を準備、送付', '', 0, '0000-00-00 00:00:00'),
(51, 3, '受渡処理', '受渡計上', '', '0000-00-00', 'DR台帳作成、インプット', '', 0, '0000-00-00 00:00:00'),
(52, 3, '受渡処理', '出荷書類ハンドリング', '', '0000-00-00', '必要部数郵送', '', 0, '0000-00-00 00:00:00'),
(53, 4, '代金回収', 'TTR入金期限管理・督促', '', '0000-00-00', '締め切り前フォロー、督促リマインド送付', '', 0, '0000-00-00 00:00:00'),
(54, 4, '代金回収', '請求用IV作成', '', '0000-00-00', '関連書類作成', '', 0, '0000-00-00 00:00:00'),
(55, 4, '代金回収', '入金処理', '', '0000-00-00', '為替期限調整、入金処理依頼', '', 0, '0000-00-00 00:00:00');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `gs_tasktemplete_table`
--
ALTER TABLE `gs_tasktemplete_table`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `gs_tasktemplete_table`
--
ALTER TABLE `gs_tasktemplete_table`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
